[
  {
    "id": "p1",
    "pregunta": "¿De qué va a tratar el evento?",
    "respuesta": "Los topics principales del Google I/O Extended Tarija 2024 son IA, Web, Cloud, Mobile y UI/UX. Contaremos con presentaciones de expertos nacionales e internacionales."
  },
  {
    "id": "p2",
    "pregunta": "¿Cómo me registro para el evento?",
    "respuesta": "Puedes registrarte en la [página oficial del GDG Tarija](https://gdgtarija.com)."
  },
  {
    "id": "p3",
    "pregunta": "¿Cuántos speakers habrá en el evento?",
    "respuesta": "Habrá 11 speakers nacionales e internacionales expertos en los diversos topics que tenemos."
  },
  {
    "id": "p4",
    "pregunta": "¿Dónde se llevará a cabo el evento?",
    "respuesta": "El evento se llevará a cabo en el Campus Central de la Universidad Católica Boliviana ubicado en la Calle Colón entre Bolívar e Ingavi, N°734."
  },
  {
    "id": "p5",
    "pregunta": "¿El evento tiene algún costo?",
    "respuesta": "La entrada es gratuita, pero los cupos son limitados. Puedes adquirir paquetes especiales para una mejor experiencia."
  },
  {
    "id": "p6",
    "pregunta": "¿Cuánto tiempo tenemos para adquirir los paquetes?",
    "respuesta": "Puedes adquirir los [paquetes](https://docs.google.com/forms/d/e/1FAIpQLScBY_KyKEcFGSC3KYuwrI6RLt_bzRqABZk6_oQutEmOVlM-Tw/viewform) hasta el viernes 12 o hasta que se agoten los cupos. Te recomendamos hacerlo lo antes posible para asegurar tu lugar."
  },
  {
    "id": "p7",
    "pregunta": "¿Se brindarán certificados?",
    "respuesta": "Sí, se darán certificados tanto físicos como digitales a las personas que adquieran los [paquetes](https://docs.google.com/forms/d/e/1FAIpQLScBY_KyKEcFGSC3KYuwrI6RLt_bzRqABZk6_oQutEmOVlM-Tw/viewform) del evento."
  },
  {
    "id": "p8",
    "pregunta": "¿Habrá transmisión en vivo del evento?",
    "respuesta": "Sí, la transmisión será por el [Facebook](https://www.facebook.com/gdgtarija) y [Youtube](https://www.youtube.com/@gdgtarija8310) del GDG Tarija."
  },
  {
    "id": "p9",
    "pregunta": "¿Habrá comida y bebida disponible en el evento?",
    "respuesta": "Sí, habrá comida para todos los asistentes y una mesa de comida exclusiva para los que adquieran los paquetes."
  },
  {
    "id": "p10",
    "pregunta": "¿El turno de la mañana y la tarde serán iguales o se tratarán temas diferentes durante todo el día?",
    "respuesta": "El evento cubrirá diferentes topics a lo largo del día, con sesiones variadas tanto en la mañana como en la tarde."
  },
  {
    "id": "p12",
    "pregunta": "¿Necesito llevar algo en particular al evento?",
    "respuesta": "No es necesario llevar nada en particular, pero te recomendamos traer un dispositivo móvil o laptop para tomar notas y participar en las actividades interactivas."
  },
  {
    "id": "p13",
    "pregunta": "¿Cómo puedo obtener más información sobre el evento?",
    "respuesta": "Puedes visitar nuestra [página oficial del GDG Tarija](https://gdgtarija.com/) o seguirnos en nuestras redes sociales para más actualizaciones."
  }
]
