[
    {
        "hora": "09:10",
        "titulo": "PaliGemma: Combinando Lenguaje y Visión para el Futuro de la IA",
        "nombre": "Alejandro Núñez Arroyo",
        "foto": "/img/speakers/Alejandro_Núñez_Arroyo.jpg",
        "tema": "AI",
        "descripcion": "En esta charla, exploraremos PaliGemma, el nuevo modelo VLM (Vision Language Model) de Google que fusiona el procesamiento del lenguaje natural y la visión artificial para crear una inteligencia artificial multimodal. Analizaremos el impacto de los modelos multimodales, los objetivos de PaliGemma, su funcionamiento, componentes, y aplicaciones. Además, presentaré herramientas para que los asistentes puedan probar PaliGemma. Concluiré con una reflexión sobre los desafíos actuales que enfrenta PaliGemma y su potencial para transformar el uso de inteligencia artificial en los próximos años.",
        "bio_speaker": "Ingeniero Mecatrónico con experiencia en la ejecución de proyectos basados en inteligencia artificial. Actualmente, se desempeña como Investigador en Inteligencia "        
    },
    {
        "hora": "09:35",
        "titulo": "Aplicación de MediaPipe en Proyectos de Desarrollo Web",
        "nombre": "Ángel Christian Flores Lazarte",
        "foto": "/img/speakers/Angel_Christian_Flores_Lazarte.jpg",
        "tema": "AI",
        "descripcion": "Descubre cómo integrar MediaPipe en tus proyectos de desarrollo web para mejorar la interactividad y funcionalidad de tus aplicaciones. Aprende técnicas prácticas para implementar soluciones de visión por computadora y reconocimiento de gestos usando esta potente herramienta de Google. Ideal para desarrolladores web interesados en expandir sus habilidades y explorar nuevas posibilidades en el campo de la inteligencia artificial aplicada.",
        "bio_speaker": "Angel es un desarrollador de software y estudiante de ing de sistemas en la UMSS, apasionado por aprender cosas nuevas y enseñar siempre que puede, miembro activo de GDG, SCESI y Angular Bolivia."
    },
    {
        "hora": "10:00",
        "titulo": "IA en la Web con Google AI Edge",
        "nombre": "Nicolas Molina Monroy",
        "foto": "/img/speakers/Nicolas_Molina_Monroy.jpg",
        "tema": "AI",
        "descripcion": "Actualmente, muchos modelos de inteligencia artificial se ejecutan en servidores y se acceden a través de APIs. Sin embargo, ¿es posible ejecutar estos modelos directamente desde un navegador web? En esta charla exploraremos esta pregunta utilizando la tecnología de Google MediaPipe, TensorFlow la cual permite operar modelos de IA directamente en el navegador.",
        "bio_speaker": "I am a Senior Full-Stack Developer with more than 10 years of experience in development and technology management. Recognized by Google as an Angular & Web Developer Expert, and by Microsoft as a Most Valuable Professional."
    },
    {
        "hora": "10:40",
        "titulo": "Desbloqueando el poder de la reactividad en Angular con Signals",
        "nombre": "Mauricio Arce Torrez",
        "foto": "/img/speakers/Mauricio_Arce_Torrez.jpg",
        "tema": "Web",
        "descripcion": "En esta charla exploraremos los nuevos Reactive Primitives introducidos en Angular con Signals, su nueva propuesta de APIs y cómo el utilizar Signals en general nos acerca al tan ansiado futuro sin zone.js para tener apps más eficientes y reactivas.",
        "bio_speaker": "Mauricio es ingeniero de sistemas, trabaja como Software Engineer en Jalasoft. Es un entusiasta de las comunidades tech, por lo cual actualmente lidera en las organizaciones "
    },
    {
        "hora": "11:05",
        "titulo": "Diseña con Gemini y Material Design 3 ",
        "nombre": "Carlos Collazos",
        "foto": "/img/speakers/Carlos_Collazos.jpg",
        "tema": "UI/UX",
        "descripcion": "Aprenderemos cómo usar Material design 3 y Gemini para diseñar interfaces mas usables y accesibles",
        "bio_speaker": "Soy senior UX designer, actualmente trabajo para NBC Sports Next, soy organizer de la comunidad GDG Cochabamba y community lead de IxDF Cochabamba una comunidad."
    },
    {
        "hora": "11:30",
        "titulo": "Project IDX: Una plataforma de desarrollo completa en la nube",
        "nombre": "Kevin Brayan Gomez Rocha",
        "foto": "/img/speakers/Kevin_Brayan_Gomez_Rocha.png",
        "tema": "Cloud",
        "descripcion": "Exploraremos Project IDX, una revolucionaria plataforma de desarrollo de Google que está transformando la forma en que creamos Software. Descubriremos cómo Project IDX simplifica y agiliza el proceso de desarrollo, permitiendo a los desarrolladores crear Software de alta calidad de manera más rápida y eficiente. A lo largo de la presentación, veremos las características clave de Project IDX, los beneficios que ofrece y cómo puede ayudarlo a llevar sus proyectos de desarrollo al siguiente nivel.",
        "bio_speaker": "Web Developer con mas de 5 años de experiencia. Amante de la tecnología, entusiasta de las comunidades tech por lo que actualmente es parte de Organizaciones como GDG Santa Cruz como Organizer, y Founder y director de CDS - Comunidad de Desarrollo de Software."
    }
]