[
    {
        "hora": "15:00",
        "titulo": "Introduction"
    },
    {
        "hora": "15:10",
        "titulo": "El flujo de trabajo del desarrollador asistido por IA con IDX",
        "nombre": "Rodrigo Torrico",
        "foto": "/img/speakers/Rodrigo_Torrico.jpeg",
        "tema": "Web",
        "descripcion": "La charla explora cómo la IA puede transformar el desarrollo de software utilizando la plataforma IDX. Se discuten casos de uso, beneficios y demostraciones prácticas de IDX. La audiencia objetivo son desarrolladores de software y personas interesadas en la IA en el desarrollo de software. Al final, los asistentes comprenderán la IA en el desarrollo de software, los casos de uso de IDX y cómo usar IDX para mejorar su flujo de trabajo.",
        "bio_speaker": "Desarrollador de software Full Stack con más de 5 años de experiencia trabajando de forma remota desde Bolivia. Posee sólidas habilidades tanto en frontend (interfaz de usuario) como backend (lógica del servidor), y es especialista en la implementación de servicios en la nube de Amazon Web Services (AWS). Además, cuenta con amplia experiencia en la implementación de prácticas de integración y entrega continua (CI/CD) para optimizar flujos de trabajo."
      
    },
    {
        "hora": "15:35",
        "titulo": "Dominando el Manejo de Estados en Flutter con Riverpod",
        "nombre": "Sebastian Gonzales Tito",
        "foto": "/img/speakers/Sebastina_Gonzales_Tito.png",
        "tema": "Mobile",
        "descripcion": "En esta charla, exploraremos cómo utilizar Riverpod para manejar estados de manera sencilla y efectiva en Flutter. Esta herramienta facilita la gestión del estado en nuestras aplicaciones, ofreciendo una alternativa moderna y más intuitiva que otros métodos tradicionales. Aprenderemos los conceptos básicos de Riverpod, cómo implementarlo en proyectos nuevos y existentes, y veremos ejemplos prácticos que te permitirán aplicar estos conocimientos de inmediato.",
        "bio_speaker": "Sebastian es estudiante de Ingeniería de Sistemas y actualmente trabaja como Desarrollador FullStack en una Startup Chilena. Organizer del GDG Sucre y Flutter Sucre, disfruta compartir y aprender en comunidad sobre las últimas tendencias tecnológicas. Su pasión por la tecnología le motiva a mantenerse siempre actualizado y a explorar continuamente nuevas innovaciones."
    },
    {
        "hora": "16:00",
        "titulo": "Kotlin Multiplatform: El futuro del desarrollo multiplataforma",
        "nombre": "Josué Lemus Miranda",
        "foto": "/img/speakers/Josue_Lemus_Miranda.jpeg",
        "tema": "Mobile",
        "descripcion": "Exploraremos el potencial de Kotlin Multiplatform (KMP) en el desarrollo multiplataforma y su comparación con otras tecnologías como Flutter. Analizaremos sus ventajas, desventajas y debatiremos si realmente puede convertirse en el futuro del desarrollo multiplataforma. Descubre si KMP y Flutter pueden coexistir y complementar tus proyectos móviles.",
        "bio_speaker": "Soy programador con 5 años de experiencia en el desarrollo móvil, durante este tiempo eh manejado tecnologías como flutter, Swift para iOS y Kotlin para Android."
    },
    {
        "hora": "16:25",
        "titulo": "Refrigerio"
    },
    {
        "hora": "16:35",
        "titulo": "Priorizando la Seguridad en Flutter",
        "nombre": "Gonzalo Caira Aguilar",
        "foto": "/img/speakers/Gonzalo_Caira_Aguilar.png",
        "tema": "Mobile",
        "descripcion": "En esta charla abordaremos buenas practicas de seguridad en el desarrollo mobile, esto nos permitirá garantizar la seguridad y fiabilidad de nuestras aplicaciones a nuestros ",
        "bio_speaker": "Software Engineer, organizador en las comunidades de GDG Arequipa y Flutter Arequipa y creador de contenido en Youtube en el canal “Hey Gonza"
    },
    {
        "hora": "17:00",
        "titulo": "¡Prepárate para sumergirte en el mundo de las API de Gemini!",
        "nombre": "Maria Griselda Garcia Flores",
        "foto": "/img/speakers/Griselda_Garcia_Flores.png",
        "tema": "AI",
        "descripcion": "En esta charla hablaremos sobre algunas de las APIs existentes para usar GEMINI en nuestra aplicación, un demo pequeño y casos de uso.",
        "bio_speaker": "Griselda es ingeniera de sistemas con más de 6 años de experiencia en desarrollo web, actualmente trabaja en Jalasoft, cuenta con un diplomado en gestión de tecnologías de la información y educación superior, es trainer del bootcamp de Jala University a nivel LATAM, Women Techmaker Ambassador y lead organizer de las comunidades Angular Bolivia y GDG Cochabamba. En sus tiempos libres le gusta ver series, películas, viajar, hacer deporte y jugar con sus gatitos."
    },
    {
        "hora": "17:25",
        "titulo": "Sorteo y foto del evento"
    },
    {
        "hora": "17:50",
        "titulo": "Fin track Tarde"
    }
]